# Brewfile

cask_args appdir: "/Applications"


# Tap Homebrew
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jdx/tap/rtx"

# Developer Tools
brew "git"
brew "wget"
brew "speedtest-cli"
brew "tree"
brew "htop"
brew "mas"
brew "rtx"
brew "cmatrix"
brew "sl"
brew "tldr"
brew "mackup" 
brew "mysql"

# Browsers & Clients
cask "arc"
cask "google-chrome"
cask "polypane"
cask "postman"

# IDE's & Design Tools
cask "visual-studio-code"
cask "intellij-idea"
cask "webstorm"
cask "phpstorm"
# cask "datagrip"
cask "figma"

# Communication
cask "discord"
cask "zoom"
cask "slack"
cask "microsoft-teams"
cask "whatsapp"
# cask "readdle-spark" - installed via app store

# System & Utils
cask "iterm2"
cask "raycast"
cask "stats"
cask "qlmarkdown"
cask "quicklook-json"
cask "flycut"
cask "mac-mouse-fix"
cask "hiddenbar"
cask "betterdisplay"
cask "shottr"
cask "numi"
cask "imageoptim"
cask "altserver"
cask "xampp"
# cask "unclack"
# cask "dbngin"

# Miscellaneous
cask "microsoft-word"
cask "iina"
cask "itsycal"
cask "folx" # to-install: Batteries
# cask "keysmith"
# cask "bitwarden"
# cask "gimp"
# cask "linear-linear"
 

# Mac App Store


# VSCode
# vscode "aaron-bond.better-comments"
# vscode "adamwalzer.scss-lint"
# vscode "aeschli.vscode-css-formatter"
# vscode "akamud.vscode-theme-onedark"
# vscode "bradlc.vscode-tailwindcss"
# vscode "christian-kohler.npm-intellisense"
# vscode "christian-kohler.path-intellisense"
# vscode "dbaeumer.vscode-eslint"
# vscode "dcasella.monokai-plusplus"
# vscode "dzhavat.css-flexbox-cheatsheet"
# vscode "eamodio.gitlens"
# vscode "ecmel.vscode-html-css"
# vscode "esbenp.prettier-vscode"
# vscode "gencer.html-slim-scss-css-class-completion"
# vscode "geyao.html-snippets"
# vscode "glenn2223.live-sass"
# vscode "hakcorp.php-awesome-snippets"
# vscode "IgorSbitnev.error-gutters"
# vscode "jakebathman.mysql-syntax"
# vscode "JakeWilson.vscode-picture"
# vscode "l7ssha.tag-inserter"
# vscode "lolkush.quickstart"
# vscode "mhutchie.git-graph"
# vscode "mrmlnc.vscode-scss"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "octref.vetur"
# vscode "PKief.material-icon-theme"
# vscode "pranaygp.vscode-css-peek"
# vscode "quicktype.quicktype"
# vscode "redhat.fabric8-analytics"
# vscode "redhat.java"
# vscode "redhat.vscode-xml"
# vscode "rifi2k.format-html-in-php"
# vscode "robertz.code-snapshot"
# vscode "shrey150.javafx-support"
# vscode "sidthesloth.html5-boilerplate"
# vscode "SilverFletcherr.vuetify-gotodocs"
# vscode "slevesque.vscode-zipexplorer"
# vscode "SonarSource.sonarlint-vscode"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "stxr.iconfont-preview"
# vscode "syler.sass-indented"
# vscode "tomoki1207.pdf"
# vscode "Umoxfo.vscode-w3cvalidation"
# vscode "vangware.dark-plus-material"
# vscode "VinceSalvino.dark-plus-black"
# vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
# vscode "VisualStudioExptTeam.vscodeintellicode"
# vscode "vscjava.vscode-java-debug"
# vscode "vscjava.vscode-java-dependency"
# vscode "vscjava.vscode-java-pack"
# vscode "vscjava.vscode-maven"
# vscode "walkme.HTML5-extension-pack"
# vscode "yandeu.five-server"
# vscode "yoavbls.pretty-ts-errors"
# vscode "zhuangtongfa.material-theme"
# vscode "Zignd.html-css-class-completion"
# vscode tamasfe.even-better-toml